{
    "id": "0",
    "title": "Portfolio",
    "categories": [
        {
            "id": "0",
            "type": "Profile",
            "title": "Profil",
            "firstName": "Bastien",
            "lastName": "Faisant",
            "welcome": "Bonjour, je suis",
            "status": "Ingénieur en informatique",
            "formation": "Diplomé de l'École Supérieure d'Ingénieurs de Rennes (ESIR)",
            "tags": [
                "Développement Web & Mobile",
                "DevOps"
            ],
            "description": "Bonjour, je suis Bastien Faisant, ingénieur en informatique diplômé de l'École Supérieure d'Ingénieurs de Rennes (ESIR).\nPassionné par le développement web et logiciel, je me spécialise dans les technologies Full Stack, avec une expertise en Java et JavaScript. Curieux et rigoureux, je suis toujours prêt à relever de nouveaux défis et à m'adapter rapidement à différents environnements de travail.\nMon dynamisme, ma capacité d'adaptation, et mon sens de l'organisation me permettent de m'intégrer efficacement au sein d'équipes innovantes pour développer des solutions performantes et pérennes."
        },
        {
            "id": "1",
            "type": "Experience",
            "title": "Expérience",
            "entities": [
                {
                    "id": "2",
                    "title": "Développeur web Full Stack",
                    "company": "ASI",
                    "location": "Cesson-Sévigné, Bretagne, France",
                    "contract": "Stage",
                    "startDate": "2024-03-05",
                    "endDate": "2024-08-30",
                    "description": "Frontend en Angular, API en Node.js avec le framework NestJS et base de données hébergée sous PostgreSQL.",
                    "image": "asi.jpg",
                    "skills": [
                        "TypeScript",
                        "Angular",
                        "Material",
                        "I18n",
                        "ESLint",
                        "Node.js",
                        "NestJS",
                        "PostgreSQL"
                    ],
                    "project": "Application web de gestion des recrutements",
                    "detail": "Ce stage au sein de l'agence rennaise ASI avait pour objectif le développement d'une application web de gestion des recrutements, destinée à l'équipe de recrutement pour centraliser et faciliter le suivi des candidats.\nA la fin de mon stage, la première version de la solution a été déployée sur le serveur de l'entreprise. Cette solution permet de gérer les candidatures, de suivre le flux des recrutements en cours et de visualiser les statistiques pour évaluer l'efficacité du processus.\nL'application vise à simplifier le quotidien des équipes de recrutement, qui devaient auparavant utiliser et coordonner plusieurs outils, entraînant une perte de temps dans la gestion et le partage de KPI. Désormais, toutes les informations sont centralisées et facilement exportables, optimisant ainsi leur efficacité.\nCette expérience a approfondi mes compétences techniques, notamment sur la sécurisation et sur la livraison de l'application. J'ai pu également être sensibilisé aux bonnes pratiques de développement tout au long de mon stage.",
                    "team": "2 développeurs, 1 product owner",
                    "method": "Méthode Kanban",
                    "tasks": [
                        "Affichage de statistiques sur le processus de recrutement (Back en NestJS, Front en Angular)",
                        "Gestion des candidats, offres et candidatures (Back en NestJS, Front en Angular)",
                        "Authentification et autorisation via le compte Microsoft (OIDC, protocole d'autorisation OAuth 2.0)",
                        "Déploiement de l'application (Nginx, Docker, Docker compose, GitLab CI)"
                    ]
                },
                {
                    "id": "1",
                    "title": "Développeur web Frontend",
                    "company": "FLYX Cloud",
                    "location": "Auderghem, Bruxelles-Capitale, Belgique",
                    "contract": "Stage",
                    "startDate": "2023-06-05",
                    "endDate": "2023-09-15",
                    "description": "Application web frontend en React avec le framework Next.js. Interaction avec le backend développé en .NET.",
                    "image": "flyx_cloud.jpg",
                    "skills": [
                        "TypeScript",
                        "React",
                        "Next.js",
                        "Styled-components",
                        "I18n",
                        "React Hooks",
                        "React Query",
                        "ESLint",
                        "React Hook Form"
                    ],
                    "project": "Solution web de gestion des commandes en white-label",
                    "detail": "Ce stage au sein de Flyx Cloud avait pour objectif de développer une solution frontend d'une application web de gestion des commandes en marque blanche destinée aux entreprises de vente au détail.\nA la fin de mon stage, le produit proposé présente le flux global d'un système de gestion de commande, de l'affichage du menu du magasin jusqu'au paiement en ligne du panier.",
                    "team": "1 développeur",
                    "method": "Méthode Kanban",
                    "tasks": [
                        "Affichage du menu d'un magasin spécifique en scannant un QR Code (React)",
                        "Commande de produits en service à table (React)",
                        "Connexion facultative à son compte pour gagner des points (Mail, Apple, Facebook, Google)",
                        "Paiement en ligne du panier (Mollie)"
                    ]
                },
                {
                    "id": "0",
                    "title": "Développeur web Full Stack",
                    "company": "Wijin",
                    "location": "Cesson-Sévigné, Bretagne, France",
                    "contract": "Stage",
                    "startDate": "2022-06-06",
                    "endDate": "2022-08-05",
                    "description": "Frontend en Flutter/Dart, API en Node.js avec le framework NestJS et base de données hébergée sous MongoDB.",
                    "image": "wijin.jpg",
                    "skills": [
                        "Dart",
                        "Flutter",
                        "TypeScript",
                        "Node.js",
                        "NestJS",
                        "MongoDB"
                    ],
                    "project": "Application web de gestion des plannings de formation",
                    "detail": "Ce stage au sein de Wijin avait pour objectif de répondre à un besoin interne à l'entreprise en développant une solution de gestion des plannings de formations sous forme d'application web.\nA la fin de mon stage, le produit a répondu à la mission d'avoir une application déployable tout en respectant la méthode de travail attendue ainsi que les mesures de santé sécurité de l'entreprise.",
                    "team": "3 développeurs, 1 product owner, 1 scrum master",
                    "method": "Méthode Scrum",
                    "tasks": [
                        "Conception de l'architecture de la solution (Flutter, NestJS)",
                        "Développement des fonctionnalités techniques (Flutter, NestJS)",
                        "Authentification via un compte Microsoft de l'entreprise",
                        "Réalisation de démonstrations bihebdomadaires"
                    ]
                }
            ]
        },
        {
            "id": "2",
            "type": "Project",
            "title": "Projets",
            "entities": [
                {
                    "id": "10",
                    "title": "Langage dédié (DSL) pour définir le comportement d'un robot",
                    "startDate": "2024-01-01",
                    "endDate": "2024-01-01",
                    "description": "Création d'un langage dédié (Domain-specific language) pour définir le comportement d'un robot via la création d'un compilateur pour interagir avec le robot et d'un interpréteur pour le simuler.",
                    "tasks": [
                        "Modélisation et implémentation du domaine avec Ecore",
                        "Création de la grammaire avec Langium (TypeScript)",
                        "Développement d'un interpréteur pour simulateur Web",
                        "Développement d'un compilateur en code Arduino"
                    ],
                    "skills": [
                        "Eclipse Modeling Framework",
                        "Ecore",
                        "Xtext",
                        "TypeScript",
                        "Langium",
                        "Language Server Protocol (LSP)",
                        "Arduino"
                    ],
                    "contents": [
                        "robot-dsl"
                    ]
                },
                {
                    "id": "9",
                    "title": "Architecture en micro-services Client-Serveur avec le protocole de communication  LwM2M",
                    "startDate": "2024-01-01",
                    "endDate": "2024-01-01",
                    "description": "Projet industriel visant à étudier la faisabilité d'une architecture Open Source couvrant le protocole LwM2M et réalisation d'une maquette l'implémentant dans un système avec différents appareils connectés.",
                    "tasks": [
                        "Analyse des protocoles de communication IoT",
                        "Etude de l'intégration du protocole LwM2M dans une architecture en microservices",
                        "Description d'une architecture utilisant les technologies étudiées",
                        "Implémentation d'un démonstrateur d'une architecture LwM2M dans un système avec appareils connectés"
                    ],
                    "skills": [
                        "Java",
                        "Spring",
                        "Spring Boot",
                        "Eclipse Leshan",
                        "Vue.js",
                        "Docker",
                        "LwM2M",
                        "CoAP"
                    ],
                    "contents": [
                        "lwm2m-project"
                    ]
                },
                {
                    "id": "8",
                    "title": "Jeu distribué sur modèle Client-Serveur",
                    "startDate": "2024-01-01",
                    "endDate": "2024-01-01",
                    "description": "Implémentation d'un jeu distribué sur modèle Client-Serveur en Java RMI permettant à plusieurs joueurs de s'affronter dans un environnement de jeu en temps réel.",
                    "tasks": [
                        "Conception de l'architecture du jeu",
                        "Implémentation du serveur de jeu en Java RMI (Java, Spring Boot, Spring Remoting RMI)",
                        "Développement des clients de jeu en Java RMI (Java, Spring Boot, Spring Remoting RMI)",
                        "Gestion des interactions entre les joueurs"
                    ],
                    "skills": [
                        "Java",
                        "Spring",
                        "Spring Boot",
                        "Spring Remoting",
                        "Java RMI",
                        "Maven",
                        "JUnit"
                    ],
                    "contents": [
                        "sr-project"
                    ]
                },
                {
                    "id": "7",
                    "title": "Génération de légendes pour des images de nourriture (Image Captioning)",
                    "startDate": "2024-01-01",
                    "endDate": "2024-01-01",
                    "description": "Entrainement d'un modèle sur un ensemble de données, développé en Python avec les bibliothèques d'apprentissage machine TensorFlow et PyTorch et affiné (fine-tuned) avec un modèle de transformateurs pré-entraînés de la bibliothèque Hugging Face Transformers.",
                    "tasks": [],
                    "skills": [
                        "Python",
                        "TensorFlow",
                        "PyTorch",
                        "Hugging Face Transformers",
                        "Pandas",
                        "Numpy"
                    ],
                    "contents": [
                        "image-captioning-project"
                    ]
                },
                {
                    "id": "5",
                    "title": "Évaluation des jeunes joueurs de football en data engineering",
                    "startDate": "2023-01-01",
                    "endDate": "2023-01-01",
                    "description": "Analyse des données de scouting pour les joueurs de football en Europe. L'objectif est de repérer les futures pépites des 7 plus grands championnats européens en se concentrant sur les joueurs de moins de 23 ans.",
                    "tasks": [
                        "Récupération des données de joueurs de football via web scraping (BeautifulSoup et Selenium WebDriver)",
                        "Traitement des données avec Pandas et Numpy",
                        "Analyse des performances des joueurs",
                        "Visualisation des données"
                    ],
                    "skills": [
                        "Python",
                        "BeautifulSoup",
                        "Selenium WebDriver",
                        "Pandas",
                        "Numpy"
                    ],
                    "contents": [
                        "foot-talent-tracker"
                    ]
                },
                {
                    "id": "4",
                    "title": "Application de jeux mobile en pair-à-pair",
                    "startDate": "2023-01-01",
                    "endDate": "2023-01-01",
                    "description": "Application de jeux en pair-à-pair. Cette application propose 6 défis à relever seul ou à plusieurs grâce à la technologie Wi-Fi Peer-to-Peer.",
                    "tasks": [
                        "Conception de l'architecture de l'application (Flutter, Dart)",
                        "Développement d'une connexion avec la technologie WiFi Peer-to-Peer (Flutter)",
                        "Conception d'un mode compétition pour jouer en mode solo ou multijoueur. Le mode multijoueur permet de jouer avec des joueurs proches à l'aide du WiFi direct.",
                        "Conception d'un mode entraînement pour jouer aux défis à volonté",
                        "Sauvegarde des scores",
                        "Réalisation de démonstrations"
                    ],
                    "skills": [
                        "Flutter",
                        "Dart"
                    ],
                    "contents": [
                        "prog-mobile-project"
                    ]
                },
                {
                    "id": "3",
                    "title": "Architecture en microservices d'un gestionnaire d'association",
                    "startDate": "2023-01-01",
                    "endDate": "2023-01-01",
                    "description": "Application web permettant d'accéder à un système de gestion administratif d'associations et d'envoyer des mails aux membres des associations.",
                    "tasks": [
                        "Conception de l'architecture de la solution",
                        "Conception d'un client frontend (Angular)",
                        "Conception d'un serveur API (NestJS) communiquant avec la base de données",
                        "Conception d'un microservice de notification (Quarkus)",
                        "Envoi de message AMQP à la queue du MOM (MessageOriented Middleware) RabbitMQ",
                        "Mise en place d'un serveur web frontend Nginx"
                    ],
                    "skills": [
                        "TypeScript",
                        "Node.js",
                        "NestJS",
                        "Angular",
                        "MySQL",
                        "Quarkus",
                        "RabbitMQ",
                        "Nginx",
                        "Docker"
                    ],
                    "contents": [
                        "architecture-administration",
                        "administrationfront",
                        "projwebassociation"
                    ]
                },
                {
                    "id": "2",
                    "title": "Compilateur pour un nouveau langage de programmation While en C++",
                    "startDate": "2023-01-01",
                    "endDate": "2023-01-01",
                    "description": "Conception et implémentation d'un compilateur pour un nouveau langage de programmation While, avec génération de code intermédiaire en 3 adresses et implémentation d'une bibliothèque d'exécution en C++.",
                    "tasks": [
                        "Conception de la grammaire du langage While",
                        "Création du lexer et du parser avec ANTLR",
                        "Génération du code intermédiaire en 3 adresses",
                        "Implémentation de la bibliothèque d'exécution pour C++",
                        "Tests unitaires et validation du compilateur"
                    ],
                    "skills": [
                        "ANTLR",
                        "Java",
                        "C++"
                    ],
                    "contents": [
                        "while_compiler"
                    ]
                },
                {
                    "id": "0",
                    "title": "Application mobile de signalisation et de nettoyage de dépôts sauvages",
                    "startDate": "2021-01-01",
                    "endDate": "2021-01-01",
                    "description": "Conception d'une application qui permet de signaler et nettoyer les déchetteries sauvages dans la périphérie rennaise.",
                    "tasks": [
                        "Développement d'une application mobile Android (Java, XML)",
                        "Utilisation de la géolocalisation pour signaler les dépôts sauvages",
                        "Utilisation de la caméra pour prendre des photos des dépôts",
                        "Utilisation de la carte pour visualiser les dépôts",
                        "Hébergement de la base de données sous Firebase",
                        "Réalisation de démonstrations"
                    ],
                    "skills": [
                        "Java",
                        "XML",
                        "Firebase"
                    ],
                    "contents": [
                        "tipe"
                    ]
                }
            ]
        },
        {
            "id": "3",
            "type": "Education",
            "title": "Formation",
            "entities": [
                {
                    "id": "2",
                    "school": "École Supérieure d'Ingénieurs de Rennes (ESIR)",
                    "degree": "Diplôme d'ingénieur de l'ESIR",
                    "speciality": "Informatique",
                    "startDate": "2021-09-01",
                    "endDate": "2024-07-05",
                    "image": "esir.png"
                },
                {
                    "id": "1",
                    "school": "École Supérieure d'Ingénieurs de Rennes (ESIR)",
                    "degree": "Cycle Universitaire Préparatoire aux Grandes Écoles (CUPGE)",
                    "speciality": "Technologie de l'information",
                    "startDate": "2019-09-01",
                    "endDate": "2021-07-05",
                    "image": "esir.png"
                },
                {
                    "id": "0",
                    "school": "Lycée Jean Guéhenno, Fougères",
                    "degree": "Baccalauréat Scientifique (BAS S)",
                    "speciality": "Sciences de l'ingénieur",
                    "startDate": "2016-09-01",
                    "endDate": "2019-07-05",
                    "image": "jean_guehenno.jpg"
                }
            ]
        }
    ]
}